app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `status`) VALUES ('hello', 'hello new article', '2024-04-09 14:48:55.739006', '2024-04-09 14:48:55.739006', 'public')

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `articles`.`updated_at` = '2024-04-09 14:25:25.897888', `articles`.`status` = 'public' WHERE `articles`.`id` = 1