app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`, `status`) VALUES ('hello', 'hiiii', 1, '2024-04-09 14:27:02.961565', '2024-04-09 14:27:02.961565', 'public')

  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1